
#include <iostream>
#include <locale.h>

int main()
{
    setlocale(LC_ALL, "rus");

    // Стандартный
    //for ("инициализация"; "условие"; "выражение_после_итерации") {
    //    // тело цикла
    //}

    // Бесконечный
    //for (;;) {
    //    // Этот цикл будет выполняться бесконечно
    //}


    // Использование изменяемой переменной в условии
    /*int n = 5;

    for (int i = 0; i < n; ++i) {
        std::cout << i << " ";
        n = 3;
    }*/



    // Ex 1:
    /*for (int i = 1; i <= 5; ++i) {
        std::cout << "Ёжик" << std::endl;
    }*/

}

