//1. Неявное приведение типов (Автоматическое приведение)
//2. Явное приведение типов (Приведение по желанию программиста)

/*int main() {
	//			1. Неявное приведение типов (Автоматическое приведение)
	//int a = 5;
	//double b = a; // Неявное приведение int к double


	//			2. Явное приведение типов (Приведение по желанию программиста)
	////2.1. С использованием статического приведения (static_cast):
	////Рекомендован для C++
	//double c = 3.14;
	//int d = static_cast<int>(c); // Явное приведение double к int

	//2.2.С использованием динамического приведения(dynamic_cast):
	// Это потом в ООП в наследовании

	//2.3. С использованием конструкции C-стиля ((type)):
	////Метод не рекомендуется
	//double e = 4.56;
	//int f = (int)e; // Явное приведение double к int (C-стиль)

	return 0;
}*/