
//int mai() {
//	// Основные типы 
//	// int	  -	целые числа		4 байта		Знаковый
//	// short  -	целые числа		2 байта		Знаковый
//	// long	  -	целые числа		4 байта		Знаковый	Точность выше чем у int
//	// long long-целые числа	8 байт		Знаковый	Точность выше чем у int
//	// 
//	// unsigned int	-целые числа			Всегда +	
//	// 
//	// double - вещественные	8 байт		Знаковый
//	// long double - вещественные	16 байт		Знаковый
//	// float  - вещественные	4 байта		Знаковый
//	// 
//	// char - символы			1 байт
//	// bool - true | false		1 байт
//	int age;
//	double salary;
//	char initial;
//	bool isStudent;
//
//	age = 30;
//	salary = 50000.00;
//	initial = 'A';
//	isStudent = true;
//
//	int count = 10;
//
//
//	int x;
//	
//	//sizeof			// Возвращает размер в байтах
//	sizeof(int);		// Размер типа данных int
//	sizeof(x);			// Размер переменной x
//	sizeof(char[10]);   // Размер массива из 10 символов
//	
//
//	//Константы 
//
//	const int MAX_VALUE = 100;
//
//}

//В C++, переменные не инициализированные явно 
// могут содержать мусорное значение.
// Это можно предотвратить, 
// инициализируя их при объявлении или перед использованием.